app/views/plays/index.html.erb

SELECT "plays".* FROM "plays"
---
    <td>
      <% play.players.each do |player| %>