app/controllers/orgs_controller.rb

SELECT "orgs".* FROM "orgs"
---
  def index
    @orgs = Org.all

INSERT INTO "orgs" ("address", "created_at", "name", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["address", ""], ["created_at", Thu, 25 Jul 2013 09:26:32 UTC +00:00], ["name", "中国国家京剧院"], ["updated_at", Thu, 25 Jul 2013 09:26:32 UTC +00:00], ["url", "http://www.cnpoc.cn"]]
---
  def create
    @org = Org.new(org_params)

    respond_to do |format|
      if @org.save

SELECT "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_org
      @org = Org.find(params[:id])