app/controllers/plays_controller.rb

  def index
    @plays = Play.all
---
SELECT "plays".* FROM "plays"

  def create
    @play = Play.new(play_params)

    respond_to do |format|
      if @play.save
---
INSERT INTO "plays" ("created_at", "name", "story", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 25 Jul 2013 09:07:32 UTC +00:00], ["name", "乌盆记"], ["story", "http://scripts.xikao.com/play/03091006"], ["updated_at", Thu, 25 Jul 2013 09:07:32 UTC +00:00]]

    def set_play
      @play = Play.find(params[:id])
---
SELECT "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT 1  [["id", "1"]]