app/controllers/shows_controller.rb

  def index
    @shows = Show.all
---
SELECT "shows".* FROM "shows"

  def create
    @show = Show.new(show_params)

    respond_to do |format|
      if @show.save
---
INSERT INTO "shows" ("created_at", "date", "theater_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 30 Jul 2013 09:01:27 UTC +00:00], ["date", Fri, 20 Sep 2013 19:30:00 UTC +00:00], ["theater_id", 1], ["updated_at", Tue, 30 Jul 2013 09:01:27 UTC +00:00]]

  def update
    respond_to do |format|
      if @show.update(show_params)
---
UPDATE "shows" SET "theater_id" = ?, "updated_at" = ? WHERE "shows"."id" = 1  [["theater_id", 2], ["updated_at", Tue, 30 Jul 2013 09:14:01 UTC +00:00]]

    def set_show
      @show = Show.find(params[:id])
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "1"]]