app/controllers/theaters_controller.rb

SELECT "theaters".* FROM "theaters"
---
  def index
    @theaters = Theater.all

INSERT INTO "theaters" ("address", "created_at", "mane", "updated_at") VALUES (?, ?, ?, ?)  [["address", "北京建国门内大街7号"], ["created_at", Tue, 30 Jul 2013 08:22:07 UTC +00:00], ["mane", "长安大戏院"], ["updated_at", Tue, 30 Jul 2013 08:22:07 UTC +00:00]]
---
  def create
    @theater = Theater.new(theater_params)

    respond_to do |format|
      if @theater.save

UPDATE "theaters" SET "name" = ?, "address" = ?, "updated_at" = ? WHERE "theaters"."id" = 1  [["name", "长安大戏院"], ["address", "北京建国门内大街7号"], ["updated_at", Tue, 30 Jul 2013 08:58:33 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @theater.update(theater_params)

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_theater
      @theater = Theater.find(params[:id])